{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 16, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_1", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 128, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_2", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_2", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 128, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_3", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"nb_col": 1, "W_constraint": null, "trainable": true, "nb_filter": 128, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_4", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_1", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_3", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 128, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_5", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_4", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 128, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_6", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_2", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_6", 0, 0], ["merge_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_5", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 256, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "same", "bias": false, "name": "convolution2d_7", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_6", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 256, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_8", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"nb_col": 1, "W_constraint": null, "trainable": true, "nb_filter": 256, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "same", "bias": false, "name": "convolution2d_9", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_3", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_8", 0, 0], ["convolution2d_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_7", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 256, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_10", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_8", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 256, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_11", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"class_name": "Merge", "name": "merge_4", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_4", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_11", 0, 0], ["merge_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_9", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "same", "bias": false, "name": "convolution2d_12", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_10", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_13", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"nb_col": 1, "W_constraint": null, "trainable": true, "nb_filter": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 1, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "same", "bias": false, "name": "convolution2d_14", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"class_name": "Merge", "name": "merge_5", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_5", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_13", 0, 0], ["convolution2d_14", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_11", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_15", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_12", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_16", "config": {"nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "bias": false, "name": "convolution2d_16", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"class_name": "Merge", "name": "merge_6", "config": {"mode": "sum", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_6", "output_mask_type": "raw", "dot_axes": -1, "arguments": {}, "output_shape": null}, "inbound_nodes": [[["convolution2d_16", 0, 0], ["merge_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"trainable": true, "axis": -1, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_13", "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_1", "config": {"trainable": true, "pool_size": [8, 8], "dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_1", "strides": [1, 1]}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 2, "b_regularizer": null, "input_dim": 131072, "name": "dense_1", "bias": false, "activation": "softmax", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 101, "b_regularizer": null, "input_dim": 131072, "name": "dense_2", "bias": false, "activation": "softmax", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0005000000237487257}, "init": "he_normal"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]]}, "keras_version": "1.2.2"}